src/domain/sci/transporter/broker/chronopost/ChronopostRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:tns="http://cxf.shipping.soap.chronopost.fr/">
  <soap:Header></soap:Header>
  <soap:Body>
    <tns:shippingMultiParcel>
      <headerValue>
        <accountNumber>19999700</accountNumber>
        <idEmit>CHRFR</idEmit>
        <identWebPro></identWebPro>
        <subAccount></subAccount>
      </headerValue>
      <shipperValue>
        <shipperAdress1>sender street address 1 ds</shipperAdress1>
        <shipperAdress2>sender street address 2 ds</shipperAdress2>
        <shipperCity>paris</shipperCity>
        <shipperCivility>M</shipperCivility>
        <shipperContactName>firstS lastS</shipperContactName>
        <shipperCountry>FR</shipperCountry>
        <shipperCountryName>FRANCE</shipperCountryName>
        <shipperEmail>ddd@ggla.com</shipperEmail>
        <shipperName>X sociale</shipperName>
        <shipperName2>firstS lastS</shipperName2>
        <shipperZipCode>75018</shipperZipCode>
        <shipperPhone>0659969984</shipperPhone>
        <shipperMobilePhone>0659969984</shipperMobilePhone>
        <shipperPreAlert>0</shipperPreAlert>
      </shipperValue>
      <customerValue>
        <customerName>WINE PROJECT</customerName>
        <customerName2></customerName2>
        <customerCivility>M</customerCivility>
        <customerContactName>Jean Voie le Colis</customerContactName>
        <customerAdress1>ADRESSE 1 EXPED</customerAdress1>
        <customerAdress2>ADRESSE 1 EXPED</customerAdress2>
        <customerZipCode>75010</customerZipCode>
        <customerCity>PARIS</customerCity>
        <customerCountry>FR</customerCountry>
        <customerCountryName>FRANCE</customerCountryName>
        <customerPhone></customerPhone>
        <customerMobilePhone>0102030405</customerMobilePhone>
        <customerEmail>jean.voielecolis@fai.fr</customerEmail>
        <customerPreAlert>0</customerPreAlert>
        <printAsSender>N</printAsSender>
      </customerValue>
      <recipientValue>
        <recipientName>X sociale</recipientName>
        <recipientName2>firstS lastS</recipientName2>
        <recipientCivility>M</recipientCivility>
        <recipientContactName>firstS lastS</recipientContactName>
        <recipientAdress1>sender street address 1 ds</recipientAdress1>
        <recipientAdress2>sender street address 2 ds</recipientAdress2>
        <recipientZipCode>75018</recipientZipCode>
        <recipientCity>paris</recipientCity>
        <recipientCountry>FR</recipientCountry>
        <recipientPhone>0659969984</recipientPhone>
        <recipientMobilePhone>0659969984</recipientMobilePhone>
        <recipientEmail>ddd@ggla.com</recipientEmail>
        <recipientPreAlert>0</recipientPreAlert>
      </recipientValue>
      <refValue>
        <customerSkybillNumber></customerSkybillNumber>
        <PCardTransactionNumber></PCardTransactionNumber>
        <recipientRef>ref123456</recipientRef>
        <shipperRef>ref123456</shipperRef>
      </refValue>
      <skybillValue>
        <bulkNumber>1</bulkNumber>
        <codCurrency>EUR</codCurrency>
        <codValue></codValue>
        <content1>GALLIA BEBE EXPERT HA 2 800G</content1>
        <content2></content2>
        <content3></content3>
        <content4></content4>
        <content5></content5>
        <customsCurrency>EUR</customsCurrency>
        <customsValue>16</customsValue>
        <evtCode>DC</evtCode>
        <insuredCurrency>EUR</insuredCurrency>
        <insuredValue>NaN</insuredValue>
        <objectType>DOC</objectType>
        <portCurrency>EUR</portCurrency>
        <productCode>01</productCode>
        <service>0</service>
        <shipHour>16</shipHour>
        <skybillRank>1</skybillRank>
        <weight>1</weight>
        <weightUnit>KGM</weightUnit>
      </skybillValue>
      <skybillParamsValue>
        <mode>THE</mode>
        <duplicata>N</duplicata>
        <withReservation>2</withReservation>
      </skybillParamsValue>
      <password>058888</password>
      <modeRetour>2</modeRetour>
      <numberOfParcel>1</numberOfParcel>
      <multiParcel>N</multiParcel>
    </tns:shippingMultiParcel>
  </soap:Body>
</soap:Envelope>
